Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: It works similarly to the way `OidcClientRequestFilter` does (see <<oidc-client-filter, Use OidcClient in MicroProfile RestClient client filter>>) - it uses `OidcClient` to acquire the access token, refresh it if needed, and set it as an HTTP `Authorization` `Bearer` scheme value. The difference is that it works with xref:rest-client-reactive.adoc[Reactive RestClient] and implements a non-blocking client filter which does not block the current IO thread when acquiring or refreshing the tokens.
ja_jp: これは `OidcClientRequestFilter` と同じように機能します (<<oidc-client-filter, Use OidcClient in MicroProfile RestClient client filter>> を参照) - `OidcClient` を使用してアクセストークンを取得し、必要に応じてリフレッシュして、HTTP `Authorization` `Bearer` スキームの値としてセットします。違いは、xref:rest-client-reactive.adoc[Reactive RestClient] で機能することと、トークンの取得や更新時に現在の IO スレッドをブロックしないノンブロッキングクライアントフィルターを実装している点です。

source: It works similarly to the way `OidcClientRequestFilter` does (see <<resteasy-client-oidc-filter,Use OidcClient in MicroProfile RestClient client filter>>) - it uses `OidcClient` to acquire the access token, refresh it if needed, and set it as an HTTP `Authorization Bearer` scheme value. The difference is that it works with xref:rest-client.adoc[Reactive RestClient] and implements a non-blocking client filter that does not block the current IO thread when acquiring or refreshing the tokens.
ja_jp: これは、 `OidcClient` を使用してトークンにアクセスし、必要に応じて更新して HTTP `Authorization` `Bearer` スキーム値として設定する点で、 `OidcClientRequestFilter` (<<resteasy-client-oidc-filter,Use OidcClient in MicroProfile RestClient client filter>> 参照) と同様に機能します。相違点は、xref:rest-client.adoc[Reactive RestClient] と連携し、トークンの取得および更新時に現在の IO スレッドをブロックしないノンブロッキングクライアントフィルターを実装します。

source: It works similarly to the way `OidcClientRequestFilter` does (see xref:oidc-client-filter[Use OidcClient in MicroProfile RestClient client filter]) - it uses `OidcClient` to acquire the access token, refresh it if needed, and set it as an HTTP `Authorization` `Bearer` scheme value. The difference is that it works with xref:rest-client-reactive.adoc[Reactive RestClient] and implements a non-blocking client filter which does not block the current IO thread when acquiring or refreshing the tokens.
ja_jp: これは、 `OidcClientRequestFilter` の方法と同様に動作します ( xref:oidc-client-filter[MicroProfile RestClient クライアントフィルターで OidcClient を使用] を参照)。 `OidcClient` を使用してアクセストークンを取得し、必要に応じてリフレッシュして、HTTP `Authorization` `Bearer` スキーム値としてセットします。違いは、 xref:rest-client-reactive.adoc[Reactive RestClient] で動作し、トークンを取得または更新するときに現在のIOスレッドをブロックしないノンブロッキングクライアントフィルタを実装している点です。

source: It works!
ja_jp: 動いています!

source: It's 2020 now, we are still using Spring Boot but fully embracing Kubernetes and other technologies like Knative, Kamel, and Ignite, just to mention a few.
ja_jp: 2020年の今、私たちはまだSpring Bootを使っていますが、Knative、Kamel、IgniteなどのKubernetesやその他の技術を全面的に取り入れています。

source: It's a bit of a hack, and definitely not something we want to maintain long term, but it was a great way to validate the idea and score a few quick wins.
ja_jp: これは少しハック的であり、長期的にメンテナンスしたいものではありませんが、アイデアを検証し、迅速に成果を上げるための素晴らしい方法でした。

source: It's a good practice to keep the logic in the callbacks "without side effects", i.e. you should avoid calling other beans inside the callbacks.
ja_jp: コールバック内のロジックを「副作用なし」に保つこと、つまり、コールバック内で他のBeanを呼び出すことは避けるべきです。

source: It's a mess because I don't know if my JPA persistence unit is using `JTA` or `Resource-level` Transaction
ja_jp: 私のJPA永続化ユニットが `JTA` を使っているのか `Resource-level` トランザクションを使っているのかわからないので、めちゃくちゃです。

source: It's a mess because I don't know if my Jakarta Persistence persistence unit is using `JTA` or `Resource-level` Transaction
ja_jp: Jakarta Persistenceの永続化ユニットが `JTA` か、 `Resource-level` Transactionか、どちらを使用しているのかが分からず混乱します

source: It's a straightforward REST client interface containing a single method. However, note the `baseUri` attribute. It starts with `stork://`. It instructs the REST client to delegate the discovery and selection of the service instances to Stork. Notice the `my-service` part in the URL. It is the service name we will be using in the application configuration.
ja_jp: これは、1つのメソッドを含む単純なRESTクライアントインターフェイスです。ただし、 `baseUri` 属性に注意してください。 `stork://` で始まっています。これは、RESTクライアントがサービスインスタンスのディスカバリーとセレクションをStorkに委ねることを指示しています。また、URLの `my-service` にもご注目ください。これは、アプリケーションの設定で使用するサービス名です。

source: It's a straightforward REST client interface containing a single method. However, note the `baseUri` attribute: * the `stork://` suffix instructs the REST client to delegate the discovery and selection of the service instances to Stork, * the `my-service` part of the URI is the service name we will be using in the application configuration.
ja_jp: これは、単一のメソッドを含む単純なRESTクライアント・インターフェイスです。ただし、 `baseUri` 属性に注意してください: * `stork://` という接尾辞は、サービスインスタンスのディスカバリとセレクションを Stork に委ねるよう REST クライアントに指示します。 * URI の `my-service` 部分は、アプリケーション設定で使用するサービス名です。

source: It's a very simple REST endpoint, returning "Hello RESTEasy" to requests on "/hello".
ja_jp: これは非常にシンプルなRESTエンドポイントで、"/hello"でのリクエストに対して"Hello RESTEasy"を返します。

source: It's a very simple REST endpoint, returning "Hello from Quarkus REST" to requests on "/hello".
ja_jp: これは非常にシンプルなRESTエンドポイントで、"/hello "へのリクエストに対して "Hello from Quarkus REST "を返します。

source: It's a very simple REST endpoint, returning "Hello from RESTEasy Reactive" to requests on "/hello".
ja_jp: これは "/hello" へのリクエストに対して "Hello RESTEasy" と返す、非常にシンプルな REST エンドポイントです。

source: It's a very simple class with a main method that starts Quarkus with a REST endpoint, returning "hello" to requests on "/hello".
ja_jp: Quarkus で REST エンドポイントを起動し、「/hello」へのリクエスト対して「hello」を返すメインメソッドを持つ、非常にシンプルなクラスです。

source: It's advised not to utilize the shim for a permanent solution but solely as a tool to smooth the migration.
ja_jp: シムを永続的な解決策として使用するのではなく、移行をスムーズにするためのツールとしてのみ使用することを推奨します。

source: It's also possible to access the iteration metadata inside the loop via the following keys:
ja_jp: また、ループ内の反復処理メタデータには、以下のキーでアクセスすることが可能です。

source: It's also possible to annotate a producer method as a global interceptor:
ja_jp: プロデューサー・メソッドをグローバル・インターセプターとしてアノテーションすることも可能です：

source: It's also possible to contribute to the engine configuration via a CDI observer method.
ja_jp: CDI observerメソッドを通じてエンジン設定に貢献することも可能です。

source: It's also possible to define optional parameters that can be used in the evaluated template.
ja_jp: また、評価済みテンプレートで使用可能なオプションのパラメーターを定義することも可能です。

source: It's also possible to define optional parameters that can be used in the included template.
ja_jp: また、インクルードされたテンプレートで使用できるオプションのパラメーターを定義することも可能です。

source: It's also possible to match the name against a regular expression specified in `matchRegex()`.
ja_jp: また、 `matchRegex()` で指定された正規表現と名前を照合することも可能です。

source: It's also possible to send an e-mail where the message body is created automatically using xref:qute.adoc[Qute templates].
ja_jp: また、 xref:qute.adoc[Quteのテンプレート] を使って、本文が自動的に作成されるメールを送信することも可能です。

source: It's also possible to use the value from another field to add a new environment variable by specifying the path of the field to be used as a source, as follows:
ja_jp: また、以下のように、ソースとして使用するフィールドのパスを指定することで、別のフィールドの値を使用して新しい環境変数を追加することも可能です。

source: It's always reasonable to set a deadline (timeout) for a gRPC client, i.e. to specify a duration of time after which the RPC times out and the client receives the status error `DEADLINE_EXCEEDED`. You can specify the deadline via the `quarkus.grpc.clients."service-name".deadline` configuration property, e.g.:
ja_jp: gRPCクライアントにデッドライン（タイムアウト）を設定することは常に合理的です。それはつまり、RPCがタイムアウトしてクライアントがステータスエラー `DEADLINE_EXCEEDED` を受け取るまでの時間を指定することです。デッドラインは、 `quarkus.grpc.clients."service-name".deadline` の設定プロパティで以下のように指定できます。

source: It's an introductory guide. The xref:vertx-reference.adoc[Vert.x reference guide] covers more advanced features such as verticles, and native transports.
ja_jp: これは入門ガイドです。 link:vertx-reference.html[Vert.xリファレンスガイド]では、バーティクルやネイティブトランスポートなど、より高度な機能について説明しています。

source: It's been quite the whirlwind tour of adding configuration to the `pom.xml` but that's just for getting the project ready for its first release; subsequent release require less tampering with configuration. We can create a git release and the Homebrew formula with the `jreleaser:full-release` goal but if you still have some doubts on how things may play out then you can invoke the goal in dry-run mode that is, let JReleaser perform all local operations as needed without affecting remote resources such as Git repositories. This is how it would look like:
ja_jp: これは `pom.xml` に設定を追加する慌ただしいツアーでしたが、これはプロジェクトの最初のリリースを準備するためのもので、それ以降のリリースでは設定に手を加える必要はありません。Git リリースと Homebrew 式を `jreleaser:full-release` というゴールで作成しますが、もしまだどうなるかわからないという場合は、ドライランモードでゴールを起動することができます。つまり、Git リポジトリなどのリモートリソースに影響を与えることなく、必要に応じてすべてのローカル操作を JReleaser に実行させます。以下のようになります。

source: It's completely OK to publish a first version of an extension that doesn't handle everything. In fact, it's OK if your extension _never_ gets to the more advanced features. This is a suggested pathway, not a minimum feature set.
ja_jp: エクステンションの最初のバージョンで、すべての機能に対応していなくてもまったく問題ありません。実際のところ、エクステンションが 最終的に高度な機能に_対応しなくても構いません_。これはあくまで推奨される開発の進め方であり、必須の機能セットではありません。

source: It's essential to understand what happened behind the scene:
ja_jp: 舞台裏で何が起こったのかを理解することが不可欠です：

source: It's must be a static method. Also, the parameter `defaultObjectMapper` will be resolved via CDI. If not found, it will throw an exception at runtime.
ja_jp: これは静的メソッドである必要があります。また、 `defaultObjectMapper` パラメーターは CDI を介して解決されます。見つからない場合は、実行時に例外がスローされます。

source: It's nice to just inject dependencies as I would expect and start coding without having to deal with a bunch of boiler-plate configuration. I can focus on what I have to do now rather than how to get there first.
ja_jp: 煩雑な設定をすることなく、期待通りに依存関係を注入してコーディングを始められるのは素晴らしいことです。まずどうやってそこに到達するかではなく、今やるべきことに集中できます。

source: It's not a mess in Quarkus :) Resource-level was introduced to support JPA in a non managed environment. But Quarkus is both lean and a managed environment so we can safely always assume we are in JTA mode. The end result is that the difficulties of running Hibernate ORM + CDI + a transaction manager in Java SE mode are solved by Quarkus.
ja_jp: Quarkusではごちゃごちゃしていません :)リソースレベルは、管理されていない環境でJPAをサポートするために導入されました。しかし、Quarkusはリーン環境であると同時にマネージド環境でもあるので、常にJTAモードになっていると思っておけば安心です。結局、Java SEモードでHibernate ORM + CDI + トランザクションマネージャーを実行することの難しさはQuarkusで解決されています。

source: It's not a mess in Quarkus :) Resource-level was introduced to support JPA in a non managed environment. But Quarkus is both lean and a managed environment, so we can safely always assume we are in JTA mode. The end result is that the difficulties of running Hibernate ORM + CDI + a transaction manager in Java SE mode are solved by Quarkus.
ja_jp: Quarkusで混乱することはありません :)リソースレベルは、管理されていない環境でJPAをサポートするために導入されました。しかし、Quarkusはリーンかつマネージドな環境なので、JTAモードであることを前提に常に安心して利用できます。結果的に、Java SEモードでHibernate ORM + CDI + トランザクションマネージャーを実行することの難しさはQuarkusによって解決されます。

source: It's not a mess in Quarkus :) Resource-level was introduced to support Jakarta Persistence in a non-managed environment. But Quarkus is both lean and a managed environment, so we can safely always assume we are in JTA mode. The end result is that the difficulties of running Hibernate ORM + CDI + a transaction manager in Java SE mode are solved by Quarkus.
ja_jp: Quarkusでは混乱しません :) リソースレベルは、非マネージド環境でjakarta Persistenceをサポートするために導入されました。 しかし、Quarkusはリーン環境であると同時にマネージド環境でもあるため、常にJTAモードであると安全に想定することができます。 その結果、Java SEモードでHibernate ORM + CDI + トランザクションマネージャを実行することの難しさは、Quarkusによって解決されました。

source: It's not easy to find the problematic part of a template when a timeout occurs. You can set the `TRACE` level for the logger `io.quarkus.qute.nodeResolve` and try to analyze the log output afterwards.
ja_jp: タイムアウトが発生したときに、テンプレートの問題のあるパーツを見つけるのは簡単ではありません。ロガー `io.quarkus.qute.nodeResolve` の `TRACE` レベルを設定し、その後ログ出力の解析を試みることができます。

source: It's not necessary to implement all three methods, but only the want you need.
ja_jp: 3 つのメソッドすべてを実装する必要はありませんが、必要なものだけを実装する必要があります。

source: It's not possible to override parts of the evaluated template.
ja_jp: 評価済みテンプレートの一部をオーバーライドすることはできません。

source: It's not possible to use the `StartupEvent` for this particular use case because this CDI event is fired before the HTTP server is started.
ja_jp: この CDI イベントは HTTP サーバーが起動する前に発生するため、この特定のユースケースで `StartupEvent` を使用することはできません。

source: It's not rare that you need to look at these various events to understand better what's going on or implement specific side effects. For example, you may need to close a resource after a completion event or log a message on failure or cancellation.
ja_jp: 何が起こっているのかをよりよく理解したり、特定の副作用を実装したりするために、これらの様々なイベントを見る必要があることは稀ではありません。例えば、完了イベントの後にリソースを閉じたり、失敗やキャンセル時にメッセージをログに記録したりする必要があるかもしれません。

source: It's not the first time that I get that kind of comment, and coming from the Vert.x project, it makes sense. Vert.x has (almost) no magic, and for a good reason: too much magic can be terrible and make production tuning utterly expensive. Sometimes you want to have more control and avoid unexpected behaviors: execute the code you wrote, and nothing else.
ja_jp: このようなコメントを受けるのは初めてではないし、Vert.xプロジェクトから来ているので、それは理にかなっています。Vert.x には(ほとんど)マジックがありませんが、それには正当な理由があります: マジックが多すぎるとひどいことになり、プロダクションチューニングが全く大変になります。時には、より多くの制御をして予期せぬ動作を避けたい場合があります: ただ書いたコードだけが実行され、それ以外は何もしないで欲しい、ということです。

source: It's not uncommon to develop an extension in a multi-module Maven project that also contains an "example" module.
ja_jp: "example" モジュールも含まれるマルチモジュール Maven プロジェクトでエクステンションを開発することは珍しくありません。

source: It's not uncommon to develop an extension in a multi-module Maven project that also contains an "example" module. However, if you want to run the example in the development mode then the `-DnoDeps` system property must be used in order to exclude the local project dependencies. Otherwise, Quarkus attempts to monitor the extension classes and this may result in weird class loading issues.
ja_jp: example "モジュールを含むマルチモジュールのMavenプロジェクトでエクステンションを開発することはよくあります。しかし、開発モードでサンプルを実行する場合は、ローカルプロジェクトの依存関係を除外するために、 `-DnoDeps` システムプロパティを使用する必要があります。そうしないと、Quarkusがエクステンションクラスを監視しようとするため、クラスの読み込みに問題が生じる可能性があります。

source: It's not. The magic happens when building the native executable:
ja_jp: 実際は、そうではありません。マジックはネイティブ実行可能ファイルをビルドするときに起こります:

source: It's now time to declare our HTTP endpoint. To do so, we need to produce a `ServletBuildItem`. At this point, we are sure you understood that if the `quarkus-undertow` dependency proposes Servlet support for our `runtime` module, we will need the `quarkus-undertow-deployment` dependency in our `deployment` module to have access to the `io.quarkus.undertow.deployment.ServletBuildItem`.
ja_jp: 次は、HTTP エンドポイントを宣言します。これを行うには、 `ServletBuildItem` を生成する必要があります。この時点では、 `quarkus-undertow` 依存関係が `runtime` モジュールの Servlet サポートを提案している場合は、 `deployment` モジュールの `quarkus-undertow-deployment` 依存関係が `io.quarkus.undertow.deployment.ServletBuildItem` にアクセスできるようにする必要があることをご理解いただけたと思います。

source: It's now time to walk the user through starting Quarkus dev mode. A common include does most of the work for us:
ja_jp: ここで、ユーザーに Quarkus 開発モードを開始する手順を説明します。一般的なインクルードが、ほとんどの作業を行います。

source: It's possible to create a custom `ConfigSource` as specified in link:https://github.com/eclipse/microprofile-config/blob/master/spec/src/main/asciidoc/configsources.asciidoc#custom-configsources-via-configsourceprovider[MicroProfile Config].
ja_jp: link:https://github.com/eclipse/microprofile-config/blob/master/spec/src/main/asciidoc/configsources.asciidoc#custom-configsources-via-configsourceprovider[MicroProfile Config] で指定されたカスタム `ConfigSource` を作成することが可能です。

source: It's possible to inject a mail template, where the message body is created automatically using xref:qute.adoc[Qute templates].
ja_jp: xref:qute.adoc[Qute テンプレート] を使って、メッセージBodyが自動的に作成されるメールテンプレートを注入することが可能です。

source: It's possible to use <<when_operators,an operator>> to specify the matching logic. Unlike in the <<if_section>> nested operators are not supported.
ja_jp: link:#when_operators[演算子] を使ってマッチングロジックを指定することができます。 <<if_section>> とは異なり、入れ子になった演算子はサポートされていません。

source: It's quite common to send messages to AMQP from a REST endpoint. To do this, create the `org.acme.MovieResource` class with the following content:
ja_jp: RESTエンドポイントからAMQPにメッセージを送信することはよくあることです。これを行うには、以下の内容で `org.acme.MovieResource` クラスを作成します:

source: It's quite common to send messages to Kafka from a REST endpoint. To do this, create the `org.acme.MovieResource` class with the following content:
ja_jp: REST エンドポイントから Kafka にメッセージを送信することはよくあることです。そのためには、以下のような内容の `org.acme.MovieResource` クラスを作成します:

source: It's recommended to annotate the health check class with `@ApplicationScoped` or the `@Singleton` scope so that a single bean instance is used for all health check requests.
ja_jp: すべてのヘルスチェックのリクエストに単一のBeanインスタンスが使用されるように、ヘルスチェッククラスに `@ApplicationScoped` または `@Singleton` のスコープでアノテーションを付けることをお勧めします。

source: It's recommended to register a `ReflectionValueResolver` instance via `Engine.addValueResolver(new ReflectionValueResolver())` so that Qute can access object properties and call public methods.
ja_jp: Qute がオブジェクトのプロパティーにアクセスし、パブリックメソッドを呼び出せるように、`Engine.addValueResolver (new ReflectionValueResolver())` を介して `ReflectionValueResolver` インスタンスを登録することが推奨されます。

source: It's sometimes necessary to enable different validation constraints for the same class when it's passed to a different method.
ja_jp: 同じクラスが別のメソッドに渡されたときに、異なるバリデーション制約を有効にする必要があることがあります。

source: It's still possible to access the `SecurityIdentity` synchronously with `public SecurityIdentity getIdentity()` in the xref:resteasy-reactive.adoc[RESTEasy Reactive] from endpoints annotated with `@RolesAllowed`, `@Authenticated`, or with respective configuration authorization checks as authentication has already happened. The same is also valid for the xref:reactive-routes.adoc[Reactive routes] if a route response is synchronous.
ja_jp: `@RolesAllowed `, `@Authenticated `, またはそれぞれの設定の認証チェックでアノテーションされたエンドポイントから、 link:resteasy-reactive.html[RESTEasy Reactive]の `public SecurityIdentity getIdentity()` で同期的に `SecurityIdentity` にアクセスすることは、すでに認証が行われているため可能です。また、ルート応答が同期的である場合、 link:reactive-routes.html[Reactiveルートについても] 同様です。

source: It's the little things
ja_jp: それは、些細なことです

source: It's the reponsibility of the deployer to clear/remove the previous state, i.e. stale jobs and triggers. Moreover, the applications that form the "Quartz cluster" should be identical, otherwise an unpredictable result may occur.
ja_jp: 前の状態、つまり古いジョブやトリガーをクリア/削除するのはデプロイ側の責任です。さらに、"Quartzクラスター"を形成するアプリケーションは同一でなければならず、そうでなければ予測不可能な結果が発生する可能性があります。

source: It's the responsibility of the deployer to clear/remove the previous state, i.e. stale jobs and triggers. Moreover, the applications that form the "Quartz cluster" should be identical, otherwise an unpredictable result may occur.
ja_jp: 前の状態、つまり古いジョブやトリガーをクリア/削除するのはデプロイ側の責任です。さらに、"Quartzクラスター"を形成するアプリケーションは同一でなければならず、そうでなければ予測不可能な結果が発生する可能性があります。

source: It's the responsibility of the deployer to define appropriate instance identifiers. Moreover, the applications that form the "Quartz cluster" should contain unique instance identifiers, otherwise an unpredictable result may occur. It's recommended to use an appropriate instance ID generator rather than specifying explicit identifiers.
ja_jp: 適切なインスタンス識別子を定義するのは、deployerの責任です。さらに、"Quartzクラスター"を形成するアプリケーションは一意のインスタンス識別子を含む必要があり、そうでない場合は予測不可能な結果が発生する可能性があります。明示的な識別子を指定するのではなく、適切なインスタンスIDジェネレーターを使用することが推奨されます。

source: It's time to configure the mailer to not simulate the sending of the emails. The Quarkus mailer is using SMTP, so make sure you have access to a SMTP server.
ja_jp: そろそろメールの送信をシミュレートしないようにmailerを設定しましょう。QuarkusのmailerはSMTPを使用しているので、SMTPサーバーにアクセスできることを確認してください。

source: It's time to configure the mailer to not simulate the sending of the emails. The Quarkus mailer is using SMTP, so make sure you have access to an SMTP server.
ja_jp: そろそろメールの送信をシミュレートしないようにmailerを設定しましょう。QuarkusのmailerはSMTPを使用しているので、SMTPサーバーにアクセスできることを確認してください。

source: It's time to step back and look at the bigger picture.
ja_jp: 一歩引いて、全体像を見る時が来ました。

source: It's too hard to setup the environment
ja_jp: 環境のセットアップが大変過ぎる

source: Items sent to the client are <<serialization,serialized>> except for the `String`, `io.vertx.core.json.JsonObject`, `io.vertx.core.json.JsonArray`, `io.vertx.core.buffer.Buffer`, and `byte[]` types. In the case of `Multi`, Quarkus subscribes to the returned `Multi` and writes the items to the `WebSocket` as they are emitted. `String`, `JsonObject` and `JsonArray` are sent as text messages. `Buffers` and byte arrays are sent as binary messages.
ja_jp: クライアントに送信される項目は、 `String`、 `io.vertx.core.json.JsonObject`、 `io.vertx.core.json.JsonArray`、 `io.vertx.core.buffer.Buffer`、および `byte[]` タイプを除いて、<<serialization,シリアライズ>> されます。 `Multi` の場合、Quarkus は返された `Multi` をサブスクライブし、項目が発行されると `WebSocket` に書き込みます。 `String`、 `JsonObject`、 `JsonArray` はテキストメッセージとして送信されます。 `Buffers` とバイト配列はバイナリーメッセージとして送信されます。

source: Iterate over the list of derived items.
ja_jp: 派生アイテムのリストを繰り返し処理します。

source: Its primary goal is to allow Java developers to run Wasm modules within the JVM, without relying on native libraries, JNI (Java Native Interface) usage, or unsafe code.
ja_jp: その主な目的は、Java 開発者がネイティブライブラリー、JNI (Java Native Interface) の使用、または unsafe なコードに依存することなく、JVM 内で Wasm モジュールを実行できるようにすることです。

source: It’s a snap to be up and running with Quarkus.
ja_jp: Quarkusを起動し実行するのは簡単です。

source: It’s been about 8 months since our last release of Quarkus Tools for VS Code. 8 months!! That's a really long time. We've introduced some new features in 1.10.0 that we're excited to mention and hope the wait was worth it.
ja_jp: 前回のQuarkus Tools for VS Codeのリリースから約8ヶ月が経ちました。8ヶ月！？本当に長い時間ですね。1.10.0では、いくつかの新機能を導入しています。

source: It’s been slowly making its way in for a while now (since 1.7), Codestarts are now the official way of generating your Quarkus applications starting from 1.10!
ja_jp: Codestartsは、(1.7から)ゆっくりと出来上がってきましたが、1.10からQuarkusアプリケーションを生成するための公式な方法になりました!

source: It’s going to be a blast. 90 odd minutes of technical discussion, some live coding and a Q&A.
ja_jp: 素晴らしい時間になるでしょう。90 分ほどの技術的な議論、ライブコーディング、そして Q&A です。

source: JACC Integration
ja_jp: JACCの統合

source: JAX-RS filters require implementing an interface and injecting context objects as fields, which is costly and inflexible. Based on our success in the Quarkus build system, filters are now simply annotated methods and any parameter is automatically injected:
ja_jp: JAX-RSのフィルターは、インターフェースを実装し、コンテキストオブジェクトをフィールドとして注入する必要がありますが、これはコストがかかり、柔軟性に欠けます。Quarkus ビルドシステムでの成功に基づき、フィルタは単にアノテーション付きのメソッドになり、全てのパラメーターは自動的に注入されるようになりました:

source: JAX-RS method that returns a `userEmail` template instance to be rendered. You do not have to use `Uni` but since you are migrating from Vert.x, you are surely very comfortable with the reactive code supported by `Uni` in Quarkus.
ja_jp: レンダリングされる `userEmail` テンプレートインスタンスを返す JAX-RS メソッドです。 `Uni` を使用する必要はありませんが、Vert.x から移行する場合、Quarkus の `Uni` でサポートされるリアクティブなコードには慣れているはずです。

source: JAX-RS methods can be annotated with https://fasterxml.github.io/jackson-annotations/javadoc/2.10/com/fasterxml/jackson/annotation/JsonView.html[@JsonView] in order to customize the serialization of the returned POJO, on a per method-basis. This is best explained with an example.
ja_jp: JAX-RS のメソッドに https://fasterxml.github.io/jackson-annotations/javadoc/2.10/com/fasterxml/jackson/annotation/JsonView.html[@JsonView] のアノテーションを付けると、返される POJO のシリアル化をメソッド単位でカスタマイズすることが可能です。これは例で説明するのが一番わかりやすいでしょう。

source: JAX-RS providers
ja_jp: JAX-RSプロバイダー

source: JBang - for Linux, macOS and Windows
ja_jp: JBang - Linux、macOS、および Windows 向け
